/*
 *   星を作ろうとしましたが、なかなか形が整わないのでゴリ押しました。ご了承ください。(´・ω・`)
 */
                                       int
                                      (b)=\
                                     sizeof(
                                    long);/**
                                   */char*flag
                                  ="\x20!#,'~X\
                                 EHMCVOC;ZJCEI";
                                #include<stdio.h>
                               void(fn)(void){/**/
                              printf("%c",flag[1]);
                             }void(Z)(int(n),int(m))
                            {for(int(i)={0};i<n;i++){
     {}printf("%c",flag[m]);}}void(Y)(int(n),int(m)){fn();Z(n,m);fn();}void(
     X)(int(n),int(m)){Z(n,m);puts("");}void(W)(int(t)){if(t!=0){Z(1,3);Z(4,
       2);}else{Z(4,2);Z(1,4);}}int(main)(void){Z(16,0);fn();Z(9,2);Z(7,0)
         ;X(1,2);Z(12,0);Y(8,2);Z(10,0);Z(2,2);X(1,1);Z(9,0);Y(8,2);Z(15
           ,0);X(3,2);Z(6,0);fn();Z(10,2);Z(18,0);X(4,2);Z(4,0);Z(9,2)
              ;Z(1,0);Z(5,2);Z(16,0);X(6,2);Z(5,0);Y(3,2);Z(6,0);Y(
                4,2);Z(14,0);X(6,2);Z(7,0);fn();Z(11,0);Z(5,2);Z(
                   12,0);Z(6,2);X(1,1);Z(21,0);Y(4,2);Z(9,0);X
                     (7,2);Z(24,0);Z(5,2);Z(7,0);X(7,2);Z(26
                    ,0);Y(4,2);Z(3,0);Z(7,2);X(1,1);Z(29,0);Z
                   (4,2);Z(1,1);X(8,2);Z(10,0);Z(2,2);Z(19,0);
                  X(10,2);while(1){Z(b,0);Z(1,3);Z(6,2);Y(10,0)
                 ;;X(13,2);Z(b-2,0);W(1);;Z(1,0);Z(24,2);Y(4,2);
                puts("");Z(b-4,0);W(1);Z(1,4);Z(4,0);Z(18,2);Z(1,
               1);Z(1,4);Z(4,0);X(5,2);   Z(b-6,0);W(1);Z(1,4);;Z(
              12,0);Z(7,2);/*Z(1,1);         Z(12,3);*/Z(14,0);Y(4,
             /*\xafecabfabc*/02);               break;;}puts("");;Z(
            1,0);W(0);Z(/*\xaca                   \xffecefcbabe*/38,0
           );X(5,/*\xfeecabc                         \xffff*/2);Z(1,0)
          ;Z(1,5);Z(2,2);                               Z(42/**/,0/**/)
         ;Z(2,2);Z(1,5                                     );/*Z(9,3);Y(
        07,4);*/;                                               getchar()
       ;/*\x0*/                                                   ;return(
      0);}                                                             /**/
